stevennolte/Module_Firmware/ESP32_Fold_Controller/src/main.cpp
// Function to handle toggle switch commands
void handleToggleCommand(const String& command, const String& action) {
  espConfig.foldData.lastMsgRecieved = millis();
  if (command == "foldOuterWings") {
      espConfig.foldData.foldOuterWingsState = (action == "on");
      Serial.printf("Fold Outer Wings: %s\n", espConfig.foldData.foldOuterWingsState ? "ON" : "OFF");
      // Add your logic here to control hardware for "Fold Outer Wings"
  } else if (command == "foldCenterWings") {
      espConfig.foldData.foldCenterWingsState = (action == "on");
      Serial.printf("Fold Center Wings: %s\n", espConfig.foldData.foldCenterWingsState ? "ON" : "OFF");
      // Add your logic here to control hardware for "Fold Center Wings"
  } else if (command == "raiseWings") {
    espConfig.foldData.raiseWingsState = (action == "on");
      Serial.printf("Raise Wings: %s\n", espConfig.foldData.raiseWingsState ? "ON" : "OFF");
      // Add your logic here to control hardware for "Raise Wings"
  } else if (command == "joystick") {
      espConfig.joystickData.joyStickActive = (action == "on");
      Serial.printf("Joystick: %s\n", espConfig.joystickData.joyStickActive ? "ON" : "OFF");
      // Add your logic here to control hardware for "Joystick"
    } else {
      Serial.println("Unknown command received.");
  }
}



#pragma endregion Webserver

void setup() {
  progData.state = 0;
  pinMode(espConfig.gpioDefs.POWER_PIN, OUTPUT);
  digitalWrite(espConfig.gpioDefs.POWER_PIN, LOW);
  myLED.startTask();
  progData.state = 2;

  // Start USB Serial Port
  Serial.begin(115200);
  delay(5000);   // Wait for the usb to connect so you can see the outputs at startup
  Serial.println("Starting up...");
  espConfig.progData.confRes = espConfig.loadConfig();
  // Start Wifi AP and Webserver for diagnostics
  // espConfig.wifiCfg.state = espWifi.makeAP();
  while (wifiCfg.state != 1){
    wifiCfg.state = espWifi.connect();
    if (millis()>120000){
      Serial.println("Failed to connect to wifi, starting AP");
      wifiCfg.state = espWifi.makeAP();
      break;
    }
  }
  wifiCfg.state = espWifi.connect();
  Serial.println("Wifi State: " + String(espConfig.wifiCfg.state));
  #pragma region Server Setup
        // Serve the main HTML page
        #pragma region Page Handlers
        server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting Home file");
          request->send(LittleFS, "/boom.html");
        });
        server.on("/product.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting Home file");
          request->send(LittleFS, "/product.html");
        });
        server.on("/settings.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting settings file");
          request->send(LittleFS, "/settings.html");
        });
        server.on("/debug.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting index file");
          request->send(LittleFS, "/debug.html");
        });
        server.on("/boom.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting boom file");
          request->send(LittleFS, "/boom.html");
        });
        #pragma endregion

        #pragma region Request Handlers
        server.on("/getDebugVars", HTTP_GET, handleDebugVars);
        server.on("/getFiles", HTTP_GET, handleFileList);
        server.on("/download", HTTP_GET, handleFileDownload);
        server.on("/reboot", HTTP_GET, handleReboot);
        
        #pragma endregion

        #pragma region Post Handlers
        server.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFileUpload);
        server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFirmwareUpload);
        server.on("/updatefs", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFilesystemUpload);

        
        server.on("/foldOuterWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
          handleToggleCommand("foldOuterWings", "on");
          request->send(200, "text/plain", "Fold Outer Wings ON");
        });

        server.on("/foldOuterWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            handleToggleCommand("foldOuterWings", "off");
            request->send(200, "text/plain", "Fold Outer Wings OFF");
        });

        server.on("/foldCenterWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            handleToggleCommand("foldCenterWings", "on");
            request->send(200, "text/plain", "Fold Center Wings ON");
        });

        server.on("/foldCenterWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            handleToggleCommand("foldCenterWings", "off");
            request->send(200, "text/plain", "Fold Center Wings OFF");
        });

        server.on("/raiseWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            handleToggleCommand("raiseWings", "on");
            request->send(200, "text/plain", "Raise Wings ON");
        });

        server.on("/raiseWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            handleToggleCommand("raiseWings", "off");
            request->send(200, "text/plain", "Raise Wings OFF");
        });
        server.on("/joystick/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            handleToggleCommand("joystick", "on");
            request->send(200, "text/plain", "Joystick ON");
        });
        server.on("/joystick/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            handleToggleCommand("joystick", "off");
            request->send(200, "text/plain", "Joystick OFF");
        });
        server.on("/fold/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            // set direction valve to fold
            request->send(200, "text/plain", "Fold Outer Wings ON");
        });
        server.on("/fold/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            // set direction valve to fold off
            request->send(200, "text/plain", "Fold Outer Wings OFF");
        });
        server.on("/unfold/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            // set direction valve to unfold
            request->send(200, "text/plain", "Unfold Outer Wings ON");
        });
        server.on("/unfold/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            // set direction valve to unfold off
            request->send(200, "text/plain", "Unfold Outer Wings OFF");
        });
        server.on("/OuterWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            // activate outer wings
            request->send(200, "text/plain", "Outer Wings ON");
        });
        server.on("/OuterWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            // deactivate outer wings
            request->send(200, "text/plain", "Outer Wings OFF");
        });
        server.on("/CenterWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            // activate rotate valves
            request->send(200, "text/plain", "Center Wings ON");
        });
        server.on("/CenterWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            // deactivate rotate valves
            request->send(200, "text/plain", "Center Wings OFF");
        });
        server.on("/raiseWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
            // activate raise wings
            request->send(200, "text/plain", "Raise Wings ON");
        });
        server.on("/raiseWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
            // deactivate raise wings
            request->send(200, "text/plain", "Raise Wings OFF");
        });
        server.on("/lowerWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
          espConfig.foldData.foldStates[espConfig.foldData.lhWingLift] = 2;
          espConfig.foldData.foldStates[espConfig.foldData.rhWingLift] = 2;
          request->send(200, "text/plain", "Lowering wings");
      });
      server.on("/lowerWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
        espConfig.foldData.lastMsgRecieved = millis();
        espConfig.foldData.foldStates[espConfig.foldData.lhWingLift] = 0;
        espConfig.foldData.foldStates[espConfig.foldData.rhWingLift] = 0;
        request->send(200, "text/plain", "stopping lowering wings");
      });
      server.on("/raiseWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
        espConfig.foldData.lastMsgRecieved = millis();
        espConfig.foldData.foldStates[espConfig.foldData.lhWingLift] = 1;
        espConfig.foldData.foldStates[espConfig.foldData.rhWingLift] = 1;
        request->send(200, "text/plain", "raising wings");
    });
    server.on("/raiseWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhWingLift] = 0;
      espConfig.foldData.foldStates[espConfig.foldData.rhWingLift] = 0;
      request->send(200, "text/plain", "stopping raising wings");
  });
   server.on("/unfoldWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhWingRotate] = 2;
      espConfig.foldData.foldStates[espConfig.foldData.rhWingRotate] = 2;
      request->send(200, "text/plain", "Unfolding wings");
  });
  server.on("/unfoldWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhWingRotate] = 0;
      espConfig.foldData.foldStates[espConfig.foldData.rhWingRotate] = 0;
      request->send(200, "text/plain", "Stopping Unfolding wings");
  });

  server.on("/flipOutWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhOuterWingRotate] = 2;
      espConfig.foldData.foldStates[espConfig.foldData.rhOuterWingRotate] = 2;
      request->send(200, "text/plain", "Unfolding Outer Wings");
  });
  server.on("/flipOutWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhOuterWingRotate] = 0;  
      espConfig.foldData.foldStates[espConfig.foldData.rhOuterWingRotate] = 0;
      request->send(200, "text/plain", "Stopping Unfolding Outer Wings");
  });
  server.on("/flipInWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhOuterWingRotate] = 1;
      espConfig.foldData.foldStates[espConfig.foldData.rhOuterWingRotate] = 1;
      request->send(200, "text/plain", "Folding Outer Wings");
  });
  server.on("/flipInWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhOuterWingRotate] = 0;
      espConfig.foldData.foldStates[espConfig.foldData.rhOuterWingRotate] = 0;
      request->send(200, "text/plain", "Stopping Folding Outer Wings");
  });
  server.on("/foldWings/on", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhWingRotate] = 1;
      espConfig.foldData.foldStates[espConfig.foldData.rhWingRotate] = 1;
      request->send(200, "text/plain", "Folding Wings");
  });
  server.on("/foldWings/off", HTTP_POST, [](AsyncWebServerRequest *request) {
      espConfig.foldData.lastMsgRecieved = millis();
      espConfig.foldData.foldStates[espConfig.foldData.lhWingRotate] = 0;
      espConfig.foldData.foldStates[espConfig.foldData.rhWingRotate] = 0;
      request->send(200, "text/plain", "Stopping Folding Wings");
  });

        server.on("/momentary", HTTP_POST, handleMomentaryCommand);
        
        
        #pragma endregion
        
        
        // Start server
        server.begin();
      #pragma endregion
  temp_sensor_start();
  espUdp.begin();
  foldControl.begin();
  
  digitalWrite(espConfig.gpioDefs.POWER_PIN, HIGH);
  
  
  progState = 1;
}

void debugPrint(){
  Serial.printf("Timestamp since boot [ms]: %lu", millis());
  Serial.println();
  Serial.printf("\tprogName: %s", espConfig.progCfg.name);
  Serial.printf(" progState: %lu", progState);
  Serial.printf(" confRes: %lu", espConfig.progData.confRes);
  Serial.printf(" wifiRes: %lu", espConfig.wifiCfg.state);
  float reading;
  temp_sensor_read_celsius(&reading);
  Serial.printf(" temp: %f", reading);
  Serial.println();
  Serial.printf("\tFree Heap: %lu", ESP.getFreeHeap());
  Serial.printf(" SSID: %s", WiFi.SSID().c_str());
  Serial.printf(" IP: %d.%d.%d.%d", wifiCfg.ips[0], wifiCfg.ips[1], wifiCfg.ips[2], wifiCfg.ips[3]);
  // Serial.println(twoWire.requestFrom(0x22, 0x01));
  // Serial.printf("Mag x: %.2f mT, y: %.2f mT, z: %.2f mT, Temp: %.2f °C\n", espConfig.magData.x, espConfig.magData.y, espConfig.magData.z, (espConfig.magData.t*1.8)+32);
  // Serial.println();
  // Serial.println(espConfig.progCfg.name);
  Serial.println();
}

void loop(){
  

  
  delay(1000);
  debugPrint();
}